lim668568-sketch/Auto_track_CAR_BALL/CAR_Control_ball/STM32_code/CAR_BALL/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define K2_Pin GPIO_PIN_2
#define K2_GPIO_Port GPIOA
#define K2_EXTI_IRQn EXTI2_IRQn
#define Right2_Pin GPIO_PIN_13
#define Right2_GPIO_Port GPIOE
#define Right1_Pin GPIO_PIN_11
#define Right1_GPIO_Port GPIOB
#define Left1_Pin GPIO_PIN_8
#define Left1_GPIO_Port GPIOD
#define Left2_Pin GPIO_PIN_10
#define Left2_GPIO_Port GPIOD
#define K3_Pin GPIO_PIN_11
#define K3_GPIO_Port GPIOD
#define K3_EXTI_IRQn EXTI15_10_IRQn
#define PWM_Left_Pin GPIO_PIN_14
#define PWM_Left_GPIO_Port GPIOD
#define PWM_Right_Pin GPIO_PIN_15
#define PWM_Right_GPIO_Port GPIOD
#define K1_Pin GPIO_PIN_7
#define K1_GPIO_Port GPIOD
#define K1_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
